# name: T1003.001 LSASS Access
# mitre: T1003.001
# description: Detect access to LSASS process
# app: search
# cron_schedule: */5 * * * *
# disabled: 0
# email_to: ${ALERT_EMAIL_TO}
# email_subject: Splunk Alert - LSASS Access
# email_message: Potential credential dumping detected.

index=sysmon EventCode=10 TargetImage="*lsass.exe" (GrantedAccess=0x1010 OR GrantedAccess=0x1410 OR GrantedAccess=0x1F0FFF)
| table _time host User SourceImage TargetImage GrantedAccess CallTrace
| sort - _time

