# name: T1027 Obfuscated Files or Information
# mitre: T1027
# description: Detect encoded or obfuscated PowerShell
# app: search
# cron_schedule: */5 * * * *
# disabled: 0
# email_to: ${ALERT_EMAIL_TO}
# email_subject: Splunk Alert - Obfuscation
# email_message: Obfuscated command detected.

index=sysmon EventCode=1 (CommandLine="*-EncodedCommand*" OR CommandLine="*[char]*" OR CommandLine="*FromBase64String*" OR CommandLine="*-Enc*")
| table _time host User CommandLine
| sort - _time