index=sysmon EventCode=1 ParentImage!="*splunkd.exe" Image="*\\reg.exe" CommandLine="*query*" OR CommandLine="*HKLM*" OR CommandLine+"*HKCU*"
| table _time host User ParentImage Image CommandLine
| sort - _time