# name: T1059.001 PowerShell Execution
# mitre: T1059.001
# description: Detect suspicious PowerShell execution patterns
# app: search
# cron_schedule: */5 * * * *
# disabled: 0
# email_to: ${ALERT_EMAIL_TO}
# email_subject: Splunk Alert - T1059.001 PowerShell Execution
# email_message: Suspicious PowerShell execution triggered in the lab.

index=sysmon EventCode=1 Image="*powershell.exe" AND ParentImage!="*splunkd.exe"
| table _time host User ParentImage Image CommandLine
| sort - _time
