title: Remote Desktop Protocol Connection in Zeek Conn
id: 5e6f4f79-9df9-4ec2-bcae-b2h7d3f8a606
status: experimental
description: Detects network connections to TCP port 3389 in Zeek conn logs, which may indicate Remote Desktop Protocol activity.
author: Anton Vulman
date: 2026-03-29
references:
  - https://attack.mitre.org/techniques/T1021/001/
logsource:
  product: zeek
  service: conn
detection:
  selection_dataset:
    event.dataset: zeek.conn
  selection_port:
    destination.port: 3389
  selection_proto:
    network.transport: tcp
  condition: selection_dataset and selection_port and selection_proto
falsepositives:
  - Legitimate administrative RDP activity
  - Help desk or system administration access
level: medium
tags:
  - attack.lateral-movement
  - attack.t1021.001